role_type = [
    "部長職", "課長職", "シニア社員業務レベルⅡ", "理事", "課長代理職", "主任職", "担当職",
    "キャリアスタッフリーダー", "キャリアエキスパート", "アソシエイト社員庶務", "アソシエイト社員事務職",
    "キャリアスタッフ", "MCスタッフ", "シニア社員業務レベルⅠ", "開発顧問（官公）", "開発顧問（金融）",
    "MCエキスパート", "MCスタッフリーダー", "技術副部長職", "技術課長職", "医療課長代理職",
    "技術課長代理職", "医療主任職", "技術主任職", "医療担当職", "技術担当職", "シニア社員アジャスター",
    "パートアルバイト", "パートその他", "嘱託１（民暴対策）", "事案スタッフリーダー", "アソシエイト社員損サ",
    "事案スタッフ", "嘱託（事務）", "医療課長職", "開発顧問（その他）", "社員兼務執行役員", "その他",
    "経営顧問（官公）", "嘱託５（職域）", "技術部長職", "アソシエイト社員火新主任", "アソシエイト社員火新アド",
    "アソシエイト社員火新リー", "主席スペシャリスト", "上席スペシャリスト", "主任スペシャリスト",
    "ナショナルスタッフ", "専属医", "スポーツ柔道・陸上", "社員兼務役員", "サブマネージャー",
    "リーダーコミュニケーター", "嘱託６（審査）", "オペレーションマネージャー", "スーパーバイザー",
    "チーフコミュニケーター", "担当コミュニケーター"
]

employee_type = [
    "総合社員エリア", "シニア社員業務レベルⅡ", "理事", "キャリアスタッフ（フル）",
    "アソシエイト社員(キャリア）", "アソシエイト社員庶務", "アソシエイト事務専任職",
    "キャリアスタッフ", "ＭＣスタッフ", "シニア社員業務レベルⅠ", "顧問（官公）",
    "顧問（金融）", "総合社員ワイド", "アソシエイト社員（ＭＣ）", "アジャスター社員グローバル",
    "シニア社員アジャスター", "パートアルバイト", "パートその他", "嘱託１（民暴対策）",
    "事案スタッフ(フル)", "アソシエイト社員損サ", "アジャスター社員エリア", "嘱託（事務）",
    "事案スタッフ", "開発顧問（その他）", "社員兼務執行役員", "総合社員グローバルAD",
    "その他", "嘱託５（職域）", "アソシエイト社員火新損サ", "スペシャリスト社員",
    "ナショナルスタッフ", "総合社員エリアAD", "専属医", "スポーツ", "社員兼務役員",
    "アソシエイト社員(コミュ)", "コミュニケーター", "嘱託６（審査）"
]


field = [
    "本社等", "営業", "営業", "損サ", "営業", "営業", "損サ", "損サ", "海外等", "損サ"
]

field_detail = [
    "本社等", "一般", "自営", "自動車ＳＣ", "企営", "マリン営", "火新ＳＣ", "傷病ＳＣ", "海外等", "マリンSC"
]

abbreviation = [
    "本社", "役員室", "理事", "本社執行役員", "監査役室", "監査役室・スタッフ",
    "担当役員", "北海道・ＡＰ", "北海道・部長", "北海道・スタッフ",
    "北海道・ＰＲＤ", "北海道・札幌１", "北海道・札幌２", "北海道・法人",
    "北海道・金融法人", "北海道・函館", "北海道中央・部長", "北海道中央・スタッフ",
    "北海道中央・ＰＲＤ", "北海道中央・旭川", "北海道中央・自営", "北海道中央・北見",
    "北海道東・部長", "北海道東・スタッフ", "北海道東・ＰＲＤ", "北海道東・釧路",
    "北海道東・自営", "北海道東・帯広", "北海道東・苫小牧", "北海道東・室蘭",
    "北海道東・千歳", "北海道自営・部長", "北海道自営・スタッフ", "北海道自営・第１",
    "北海道自営・第２", "北海道自営・函館自営", "北海道損サ・部長", "北海道損サ・スタッフ",
    "北海道損サ・札幌１ＳＣ", "北海道損サ・札幌２ＳＣ", "北海道損サ・札幌３ＳＣ",
    "北海道損サ・旭川ＳＣ", "北海道損サ・旭川ＳＣ・北見ＳＣ", "北海道損サ・釧路ＳＣ",
    "北海道損サ・釧路ＳＣ・帯広ＳＣ", "北海道損サ・苫小牧ＳＣ", "北海道損サ・函館ＳＣ",
    "東北・仙台ＡＰ", "東北・盛岡ＡＰ", "仙台・部長", "仙台・スタッフ",
    "仙台・ＰＲＤ", "仙台・仙台１", "仙台・仙台２", "仙台・仙台３",
    "仙台・石巻", "仙台自営・部長", "仙台自営・スタッフ", "仙台自営・第１",
    "仙台自営・第２", "青森・部長", "青森・スタッフ", "青森・ＰＲＤ",
    "青森・青森", "青森・自営", "青森・八戸", "岩手・部長",
    "岩手・スタッフ", "岩手・ＰＲＤ", "岩手・盛岡１", "岩手・盛岡２",
    "岩手・北上", "秋田・部長", "秋田・スタッフ", "秋田・ＰＲＤ",
    "秋田・秋田", "秋田・自営", "山形・部長", "山形・スタッフ",
    "山形・ＰＲＤ", "山形・山形", "山形・自営", "山形・庄内",
    "福島・部長", "福島・スタッフ", "福島・ＰＲＤ", "福島・郡山",
    "福島・会津", "福島・福島", "福島・いわき", "福島・自営",
    "東北損サ・部長", "東北損サ・スタッフ", "東北損サ・仙台１ＳＣ", "東北損サ・仙台２ＳＣ",
    "東北損サ・青森ＳＣ", "東北損サ・青森ＳＣ・八戸ＳＣ", "東北損サ・盛岡ＳＣ",
    "東北損サ・秋田ＳＣ", "東北損サ・山形ＳＣ", "東北損サ・山形ＳＣ・酒田ＳＣ",
    "東北損サ・郡山ＳＣ", "東北損サ・郡山ＳＣ・いわきＳＣ"
]

LIST_FIELD = ["本社等", "営業", "営業", "損サ", "営業", "営業", "損サ", "損サ", "海外等", "損サ"]

LIST_FIELD_DETAIL = [
    "本社等",
    "一般",
    "自営",
    "自動車ＳＣ",
    "企営",
    "マリン営",
    "火新ＳＣ",
    "傷病ＳＣ",
    "海外等",
    "マリンSC",
]

FIELD_MAPPING = [
    ("営業", "一般"),
    ("営業", "企営"),
    ("営業", "自営"),
    ("損サ", "自動車ＳＣ"),
    ("損サ", "火新ＳＣ"),
    ("損サ", "傷病ＳＣ"),
    ("損サ", "マリンSC"),
    ("本社等", "本社等"),
    ("海外等", "海外等"),
]
