role_type = [
    "部長職", "課長職", "シニア社員業務レベルⅡ", "理事", "課長代理職", "主任職", "担当職",
    "キャリアスタッフリーダー", "キャリアエキスパート", "アソシエイト社員庶務", "アソシエイト社員事務職",
    "キャリアスタッフ", "MCスタッフ", "シニア社員業務レベルⅠ", "開発顧問（官公）", "開発顧問（金融）",
    "MCエキスパート", "MCスタッフリーダー", "技術副部長職", "技術課長職", "医療課長代理職",
    "技術課長代理職", "医療主任職", "技術主任職", "医療担当職", "技術担当職", "シニア社員アジャスター",
    "パートアルバイト", "パートその他", "嘱託１（民暴対策）", "事案スタッフリーダー", "アソシエイト社員損サ",
    "事案スタッフ", "嘱託（事務）", "医療課長職", "開発顧問（その他）", "社員兼務執行役員", "その他",
    "経営顧問（官公）", "嘱託５（職域）", "技術部長職", "アソシエイト社員火新主任", "アソシエイト社員火新アド",
    "アソシエイト社員火新リー", "主席スペシャリスト", "上席スペシャリスト", "主任スペシャリスト",
    "ナショナルスタッフ", "専属医", "スポーツ柔道・陸上", "社員兼務役員", "サブマネージャー",
    "リーダーコミュニケーター", "嘱託６（審査）", "オペレーションマネージャー", "スーパーバイザー",
    "チーフコミュニケーター", "担当コミュニケーター"
]

employee_type = [
    "総合社員エリア", "シニア社員業務レベルⅡ", "理事", "キャリアスタッフ（フル）",
    "アソシエイト社員(キャリア）", "アソシエイト社員庶務", "アソシエイト事務専任職",
    "キャリアスタッフ", "ＭＣスタッフ", "シニア社員業務レベルⅠ", "顧問（官公）",
    "顧問（金融）", "総合社員ワイド", "アソシエイト社員（ＭＣ）", "アジャスター社員グローバル",
    "シニア社員アジャスター", "パートアルバイト", "パートその他", "嘱託１（民暴対策）",
    "事案スタッフ(フル)", "アソシエイト社員損サ", "アジャスター社員エリア", "嘱託（事務）",
    "事案スタッフ", "開発顧問（その他）", "社員兼務執行役員", "総合社員グローバルAD",
    "その他", "嘱託５（職域）", "アソシエイト社員火新損サ", "スペシャリスト社員",
    "ナショナルスタッフ", "総合社員エリアAD", "専属医", "スポーツ", "社員兼務役員",
    "アソシエイト社員(コミュ)", "コミュニケーター", "嘱託６（審査）"
]


field = [
    "本社等", "営業", "営業", "損サ", "営業", "営業", "損サ", "損サ", "海外等", "損サ"
]

field_detail = [
    "本社等", "一般", "自営", "自動車ＳＣ", "企営", "マリン営", "火新ＳＣ", "傷病ＳＣ", "海外等", "マリンSC"
]
